rails/URLShortener/app/models/shortened_url.rb

  def self.random_code
    loop do
      url = SecureRandom.urlsafe_base64(16)
      return url unless self.exists?(short_url: url)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "voX6bT-4PIfCxTOVuB43iA"], ["LIMIT", 1]]

  def self.generate_short_url!(user, long_url)
    ShortenedUrl.create!({
      user_id: user.id,
      long_url: long_url,
      short_url: self.random_code
    })
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "voX6bT-4PIfCxTOVuB43iA"], ["long_url", "www.google.com"], ["user_id", 3], ["created_at", "2021-04-30 17:08:14.275043"], ["updated_at", "2021-04-30 17:08:14.275043"]]