rails/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "1V8DFGyAxOIAEmRNKShSxA"], ["LIMIT", 1]]
---
  def self.random_code
    loop do
      url = SecureRandom.urlsafe_base64(16)
      return url unless self.exists?(short_url: url)

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "1V8DFGyAxOIAEmRNKShSxA"], ["long_url", "http://www.appacademy.io"], ["user_id", 3], ["created_at", "2021-04-30 16:26:00.127946"], ["updated_at", "2021-04-30 16:26:00.127946"]]
---
  def self.generate_short_url(user, long_url)
    ShortenedUrl.create!({
      user_id: user.id,
      long_url: long_url,
      short_url: self.random_code
    })